УТ_для_edt.РасширениеСмарт/src/DataProcessors/ПодборТоваровВДокументПродажи/ПодборТоваровВДокументПродажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ПодборТоваровВДокументПродажи</name>
  <objectBelonging>Adopted</objectBelonging>
  <tabularSections>
    <name>Корзина</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>НоменклатураНабора</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВариантОбеспечения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Артикул</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>50</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ХарактеристикаНабора</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ПроцентРучнойСкидки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>5</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СуммаРучнойСкидки</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Склад</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДатаОтгрузки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

УТ_для_edt.РасширениеСмарт/src/InformationRegisters/НоменклатураСегмента/НоменклатураСегмента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>НоменклатураСегмента</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <dimensions>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Сегмент</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt.РасширениеСмарт/src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЦеныНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>ВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt.РасширениеСмарт/src/AccumulationRegisters/ТоварыОрганизаций/ТоварыОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТоварыОрганизаций</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources>
    <name>Количество</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions>
    <name>АналитикаУчетаНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>ВидЗапасов</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

УТ_для_edt.РасширениеСмарт/src/Catalogs/УпаковкиЕдиницыИзмерения/УпаковкиЕдиницыИзмерения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>УпаковкиЕдиницыИзмерения</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
    <owners>Checked</owners>
  </extension>
  <hierarchical>true</hierarchical>
  <owners>Catalog.Номенклатура</owners>
  <owners>Catalog.НаборыУпаковок</owners>
  <attributes>
    <name>Высота</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Объем</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>18</precision>
          <scale>6</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Вес</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Глубина</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>СкладскаяГруппа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Типоразмер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Ширина</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>МинимальноеКоличествоУпаковокМногооборотнойТары</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Безразмерная</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТипУпаковки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Числитель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ОбъемЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КоличествоУпаковок</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Знаменатель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ХарактеристикаМногооборотнаяТара</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПоставляетсяВМногооборотнойТаре</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВесЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВысотаЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ШиринаЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГлубинаЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НоменклатураМногооборотнаяТара</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТипИзмеряемойВеличины</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

УТ_для_edt.РасширениеСмарт/src/DataProcessors/ПодборТоваровВДокументПродажи/Forms/Форма/Module.bsl
#Область ДоработкиСмарт

//++ смарт:ММ #065 345 29.08.2020 - Подсветка номенклатуры определенного сегмента при подборе
Процедура смарт_ПриСозданииНаСервереПосле()
    
    Если ТипЗнч(Параметры.Документ) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
        смартУстановитьУсловноеОформление();
    КонецЕсли;
    
    //++ смарт:Подкин #1025 20.05.2022 18:18:27
    ПродажаВРублях=НЕ Справочники.смартПредопределенныеЗначения.ПереходНаПродажуВРублях.Значение=Неопределено И Справочники.смартПредопределенныеЗначения.ПереходНаПродажуВРублях.Значение; 
	Если НЕ ПродажаВРублях ИЛИ Пользователи.ЭтоПолноправныйПользователь() ИЛИ Пользователи.РолиДоступны("смартРазрешитьПросмотрВсехВидовЦенВВалюте") Тогда
        
        //++ смарт:Подкин #984 18.04.2022 15:41:32 
        Если НЕ Справочники.смартПредопределенныеЗначения.ПодборПродажаВалютаРубЦБ.Значение=Неопределено 
            И Справочники.смартПредопределенныеЗначения.ПодборПродажаВалютаРубЦБ.Значение 
            И НЕ ЭтаФорма.ВариантРасчетаЦен=Перечисления.ВариантыРасчетаЦенПоСоглашениямСКлиентами.БезЦен 
            И (ЭтаФорма.Заголовок="Подбор товаров в помощник продаж" ИЛИ ТипЗнч(Параметры.Документ) = Тип("ДокументСсылка.ЗаказКлиента")) Тогда
            
            ТекстБыло1 = " КАК Цена,";
            ТекстСтало1= " КАК Цена,
            |
            |ВЫРАЗИТЬ(ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0) * ВЫБОР
            | 	КОГДА &Валюта <> ЦеныНоменклатуры.Валюта
            | 		ТОГДА ВЫБОР
            | 				КОГДА ЕСТЬNULL(КурсыСрезПоследнихВалютаЦены2.Кратность, 0) > 0
            | 						И ЕСТЬNULL(КурсыСрезПоследнихВалютаЦены2.Курс, 0) > 0
            | 						И ЕСТЬNULL(КурсыСрезПоследнихВалютаДокумента.Кратность, 0) > 0
            | 						И ЕСТЬNULL(КурсыСрезПоследнихВалютаДокумента.Курс, 0) > 0
            | 					ТОГДА КурсыСрезПоследнихВалютаЦены2.Курс * КурсыСрезПоследнихВалютаДокумента.Кратность / (КурсыСрезПоследнихВалютаДокумента.Курс * КурсыСрезПоследнихВалютаЦены2.Кратность)
            | 				ИНАЧЕ 0
            | 			КОНЕЦ
            | 	ИНАЧЕ 1
            | КОНЕЦ КАК ЧИСЛО(31,2)) КАК ЦенаЕвроЦБ,  "; 
            СписокНоменклатура.ТекстЗапроса = СтрЗаменить(СписокНоменклатура.ТекстЗапроса, 
            ТекстБыло1, 
            ТекстСтало1);
            СписокХарактеристики.ТекстЗапроса = СтрЗаменить(СписокХарактеристики.ТекстЗапроса, 
            ТекстБыло1, 
            ТекстСтало1); 
            
            ТекстБыло2 = "ПО (КурсыСрезПоследнихВалютаЦены.Валюта = ЦеныНоменклатуры.Валюта)";
            ТекстСтало2 = "ПО (КурсыСрезПоследнихВалютаЦены.Валюта = ЦеныНоменклатуры.Валюта) 
            |ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(,Валюта = &Валюта2 ) КАК КурсыСрезПоследнихВалютаЦены2
            |ПО (ИСТИНА) ";  
            
            СписокНоменклатура.ТекстЗапроса = СтрЗаменить(СписокНоменклатура.ТекстЗапроса, 
            ТекстБыло2, 
            ТекстСтало2);
            СписокХарактеристики.ТекстЗапроса = СтрЗаменить(СписокХарактеристики.ТекстЗапроса, 
            ТекстБыло2, 
            ТекстСтало2); 
            
            ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокНоменклатура, "Валюта2", Константы.ВалютаУправленческогоУчета.Получить()); 
            ПодборТоваровКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокХарактеристики, "Валюта2", Константы.ВалютаУправленческогоУчета.Получить());  
            
            КолонкаЦенаЕвро = Элементы.Вставить("СписокРасширенныйПоискНоменклатураЦенаЕвро", Тип("ПолеФормы"), Элементы.СписокРасширенныйПоискНоменклатура, Элементы.СписокРасширенныйПоискНоменклатураВНаличииОстаток);
            КолонкаЦенаЕвро.ПутьКДанным = "СписокНоменклатура.ЦенаЕвроЦБ";
            КолонкаЦенаЕвро.Заголовок = "Цена (руб.) ЦБ";
            КолонкаЦенаЕвро.Вид = ВидПоляФормы.ПолеВвода;      
            
            КолонкаЦенаЕвро2 = Элементы.Вставить("СписокРасширенныйПоискХарактеристикиЦенаЕвро", Тип("ПолеФормы"), Элементы.СписокРасширенныйПоискХарактеристики, Элементы.СписокРасширенныйПоискХарактеристикиВНаличииОстаток);
            КолонкаЦенаЕвро2.ПутьКДанным = "СписокХарактеристики.ЦенаЕвроЦБ";
            КолонкаЦенаЕвро2.Заголовок = "Цена (руб.) ЦБ";
            КолонкаЦенаЕвро2.Вид = ВидПоляФормы.ПолеВвода;   
            
            КолонкаЦенаЕвро3 = Элементы.Вставить("СписокСтандартныйПоискНоменклатураЦенаЕвро", Тип("ПолеФормы"), Элементы.СписокСтандартныйПоискНоменклатура, Элементы.СписокСтандартныйПоискНоменклатураВНаличииОстаток);
            КолонкаЦенаЕвро3.ПутьКДанным = "СписокНоменклатура.ЦенаЕвроЦБ";
            КолонкаЦенаЕвро3.Заголовок = "Цена (руб.) ЦБ";
            КолонкаЦенаЕвро3.Вид = ВидПоляФормы.ПолеВвода;      
            
            КолонкаЦенаЕвро4 = Элементы.Вставить("СписокСтандартныйПоискХарактеристикиЦенаЕвро", Тип("ПолеФормы"), Элементы.СписокСтандартныйПоискХарактеристики, Элементы.СписокСтандартныйПоискХарактеристикиВНаличииОстаток);
            КолонкаЦенаЕвро4.ПутьКДанным = "СписокХарактеристики.ЦенаЕвроЦБ";
            КолонкаЦенаЕвро4.Заголовок = "Цена (руб.) ЦБ";
            КолонкаЦенаЕвро4.Вид = ВидПоляФормы.ПолеВвода; 
        КонецЕсли;
        //-- смарт:Подкин #984 18.04.2022 15:41:32  
    КонецЕсли;
    //-- смарт:Подкин #1025 20.05.2022 18:18:27 
    
    //++ смарт:Подкин #1099 14.07.2022 15:49:03 
    //Вывод резервов 
	//++#1216 смарт: Лопато 11.10.2022 //Ошибка в форме "Подбор товара"
	//СписокНоменклатура.ТекстЗапроса = СтрЗаменить(СписокНоменклатура.ТекстЗапроса," КАК Доступно"," КАК Доступно, 
	//| ВЫРАЗИТЬ((ЕСТЬNULL(СвободныеОстатки.ВРезервеСоСкладаОстаток, 0)) КАК ЧИСЛО(15, 3)) КАК Резерв");
	//--#1216 смарт: Лопато 11.10.2022
       
    КолонкаРезерв = Элементы.Вставить("СписокРасширенныйПоискНоменклатураРезерв", Тип("ПолеФормы"), Элементы.СписокРасширенныйПоискНоменклатура, Элементы.СписокРасширенныйПоискНоменклатураУпаковкаЕдиницаИзмерения);
    КолонкаРезерв.ПутьКДанным = "СписокНоменклатура.Резерв";
    КолонкаРезерв.Заголовок = "Резерв";
    КолонкаРезерв.Вид = ВидПоляФормы.ПолеВвода; 
    
    КолонкаРезерв1 = Элементы.Вставить("СписокСтандартныйПоискНоменклатураРезерв", Тип("ПолеФормы"), Элементы.СписокСтандартныйПоискНоменклатура, Элементы.СписокСтандартныйПоискНоменклатураУпаковкаЕдиницаИзмерения);
    КолонкаРезерв1.ПутьКДанным = "СписокНоменклатура.Резерв";
    КолонкаРезерв1.Заголовок = "Резерв";
    КолонкаРезерв1.Вид = ВидПоляФормы.ПолеВвода;      
    
    Элементы.СписокРасширенныйПоискНоменклатураРезерв.Формат = "ЧДЦ=3";
    Элементы.СписокСтандартныйПоискНоменклатураРезерв.Формат = "ЧДЦ=3"; 
    
    Элемент = УсловноеОформление.Элементы.Добавить();    
    ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
    ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СписокРасширенныйПоискНоменклатураРезерв.Имя);
    ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
    ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СписокСтандартныйПоискНоменклатураРезерв.Имя);    
    
    ГруппаОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
    ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
    
    ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СписокНоменклатура.Резерв");
    ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
    ОтборЭлемента.ПравоеЗначение = 0;  
    Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<нет>'"));
    Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветТекстаОтмененнойСтрокиДокумента);     
    Элементы.ОстаткиТоваров.ЦветФона = Новый Цвет(248, 255, 255);
    //-- смарт:Подкин #1099 14.07.2022 15:49:03 
    
    //++ смарт:ММ #091 401 03.01.2021 - Фото товара в форме подбора
    смартДобавитьЭлементыНаФорму();
    смартНастроитьВидимостьДоступность();
    //-- смарт:ММ 03.01.2021
	
	//++ #Б3742 смарт: Шляпников 20.08.2025 / Подбор аналогов при выборе товара
	Команда = Команды.Добавить("смартПоказатьАналоги");
	Команда.Действие = "смартПоказатьАналогиКлиент";
	Команда.Заголовок = "Подобрать аналог";
	
	//++ #Б-4844 смарт: Фролов 11.11.2025 //Сделать кнопку "Подбор аналогов" видимой 
	//Кнопка = Элементы.Добавить("смартПоказатьАналоги", Тип("КнопкаФормы"), Элементы.КоманднаяПанельПоискНоменклатура);
	Кнопка = Элементы.Вставить("смартПоказатьАналоги", Тип("КнопкаФормы"), Элементы.КоманднаяПанельПоискНоменклатура, 
		Элементы.КоманднаяПанельРасширенныйПоискКарточка);
	Элементы.смартПоказатьАналоги.ПоложениеВКоманднойПанели = ПоложениеКнопкиВКоманднойПанели.ВКоманднойПанелиИВДополнительномПодменю;	
	//-- #Б-4844 смарт: Фролов 11.11.2025	
		
	Кнопка.ИмяКоманды = "смартПоказатьАналоги";
	
	Кнопка = Элементы.Добавить("смартПоказатьАналоги1", Тип("КнопкаФормы"), Элементы.СписокСтандартныйПоискНоменклатураКоманднаяПанель);
	Кнопка.ИмяКоманды = "смартПоказатьАналоги";
	Кнопка.ПоложениеВКоманднойПанели = ПоложениеКнопкиВКоманднойПанели.ВКоманднойПанелиИВДополнительномПодменю;
	
	Элемент = Элементы.Добавить("смартКоличествоАналогов", Тип("ПолеФормы"), Элементы.СписокРасширенныйПоискНоменклатура);
	Элемент.ПутьКДанным = "СписокНоменклатура.КоличествоАналогов";
	Элемент.Заголовок = "Аналог";
	
	Элемент = Элементы.Добавить("смартКоличествоАналогов1", Тип("ПолеФормы"), Элементы.СписокСтандартныйПоискНоменклатура);
	Элемент.ПутьКДанным = "СписокНоменклатура.КоличествоАналогов";
	Элемент.Заголовок = "Аналог";
	//-- #Б3742 смарт: Шляпников 20.08.2025
	
	//++ #Б4670 смарт: Шляпников 21.10.2025 / Маркировка радиоэлектронной продукции. Доработка справочника "Номенклатура".
	смартМаркировка.МодифицироватьФормуСпискаНоменклатуры(ЭтаФорма);
	//-- #Б4670 смарт: Шляпников 21.10.2025
	
	//++ #Б4818 смарт: Шляпников 17.11.2025 / Создание механизма учета скидок и акций по оборудованию. 
	смартАкцииИСкидки.ДобавитьИнформациюОбАкцияхнаФормуПодбора(ЭтаФорма);
	//-- #Б4818 смарт: Шляпников 17.11.2025
      
КонецПроцедуры //-- смарт:ММ 29.08.2020

//++ смарт:ММ #065 345 29.08.2020 - Подсветка номенклатуры определенного сегмента при подборе
&НаСервере
Процедура смартУстановитьУсловноеОформление()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	смартПредопределенныеЗначения.Значение КАК Значение
	|ПОМЕСТИТЬ ВТ_СегментыПоАкции
	|ИЗ
	|	Справочник.смартПредопределенныеЗначения КАК смартПредопределенныеЗначения
	|ГДЕ
	|	НЕ смартПредопределенныеЗначения.СписокЗначений
	|	И смартПредопределенныеЗначения.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	смартПредопределенныеЗначенияЗначения.Значение
	|ИЗ
	|	Справочник.смартПредопределенныеЗначения.Значения КАК смартПредопределенныеЗначенияЗначения
	|ГДЕ
	|	смартПредопределенныеЗначенияЗначения.Ссылка.СписокЗначений
	|	И смартПредопределенныеЗначенияЗначения.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НоменклатураСегмента.Номенклатура КАК Номенклатура,
	|	НоменклатураСегмента.Характеристика КАК Характеристика
	|ИЗ
	|	РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СегментыПоАкции КАК ВТ_СегментыПоАкции
	|		ПО НоменклатураСегмента.Сегмент = ВТ_СегментыПоАкции.Значение";
	
	Запрос.УстановитьПараметр("Ссылка", Справочники.смартПредопределенныеЗначения.СегментНоменклатурыПоАкции);
	
	СписокНоменклатуры = Новый СписокЗначений;
	СписокНоменклатуры.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Номенклатура"));
	
	Если СписокНоменклатуры.Количество() > 0 Тогда
		
		Элемент = УсловноеОформление.Элементы.Вставить(0);

		// Расширенный
		//ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		//ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СписокРасширенныйПоискНоменклатура.Имя);  // Так выделяются только Наименование, Артикул и Ед. изм.
		
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СписокРасширенныйПоискНоменклатураНаименование.Имя);
		
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СписокРасширенныйПоискНоменклатураАртикул.Имя);

		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("СписокРасширенныйПоискНоменклатураЦена"); // Почему-то не отрабатывает. Как ВНаличииОстаток и Доступно =(
		
		// Стандартный
		//ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		//ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СписокСтандартныйПоискНоменклатура.Имя); // Так выделяются только Наименование, Артикул и Ед. изм.

		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СписокСтандартныйПоискНоменклатураНаименование.Имя);
		
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СписокСтандартныйПоискНоменклатураАртикул.Имя);

		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СписокСтандартныйПоискНоменклатураЦена.Имя); // Почему-то не отрабатывает. Как ВНаличииОстаток и Доступно =(
			
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СписокНоменклатура.Номенклатура");	
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
		ОтборЭлемента.ПравоеЗначение = СписокНоменклатуры;
		
		Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.ЛососьСветлый);
		
		СтарыйШрифт = Элемент.Оформление.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Шрифт")).Значение;
		Шрифт = Новый Шрифт(СтарыйШрифт,,, Истина); 
		Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", Шрифт);
		
	КонецЕсли;
	
КонецПроцедуры //-- смарт:ММ 29.08.2020

//++ смарт:ММ #091 401 03.01.2021 - Фото товара в форме подбора
&НаСервере
Процедура смартДобавитьЭлементыНаФорму()
    
    // Реквизиты формы
    ДобавляемыеРеквизиты = Новый Массив;
    
    Реквизит_смартПоказыватьКартинки = Новый РеквизитФормы("смартПоказыватьКартинки", Новый ОписаниеТипов("Булево"), , "Показывать картинку");
    Реквизит_смартАдресКартинки = Новый РеквизитФормы("смартАдресКартинки", Новый ОписаниеТипов("Строка"), , "");
    
    //++ Смарт:  Демичев №860 13.01.2022
    мМассивТипТаблица = Новый Массив;
    мМассивТипТаблица.Добавить(Тип("ТаблицаЗначений"));
    
    Реквизит_смартТаблицаЦен = Новый РеквизитФормы("смартТаблицаСЦенами", Новый ОписаниеТипов(мМассивТипТаблица), "", "Цены");
    Реквизит_смартПоказыватьЦены = Новый РеквизитФормы("смартПоказыватьАктуальныеЦены", Новый ОписаниеТипов("Булево"), , "Показывать цены");
    
    мМассивТипВидыЦен = Новый Массив;
    мМассивТипВидыЦен.Добавить(Тип("СправочникСсылка.ВидыЦен"));
    
    мМассивТипХарНоменклатуры = Новый Массив;
    мМассивТипХарНоменклатуры.Добавить(Тип("СправочникСсылка.ХарактеристикиНоменклатуры"));
    
    мМассивТипЕдИзмерения = Новый Массив;
    мМассивТипЕдИзмерения.Добавить(Тип("СправочникСсылка.УпаковкиЕдиницыИзмерения")); 
    
    мМассивЧисло = Новый Массив;
    мМассивЧисло.Добавить(Тип("Число"));
    
    ОписаниеВидЦен = Новый ОписаниеТипов(мМассивТипВидыЦен);
    ОписаниеХарактеристика = Новый ОписаниеТипов(мМассивТипХарНоменклатуры);
    ОписаниеУпаковка = Новый ОписаниеТипов(мМассивТипЕдИзмерения);
    
    КВЧисла = Новый КвалификаторыЧисла(15,2);	
    ОписаниеЦена = Новый ОписаниеТипов(мМассивЧисло,,,КВЧисла);
    
    ТЗЦены = Новый ТаблицаЗначений;
    ТЗЦены.Колонки.Добавить("ВидЦены", ОписаниеВидЦен);
    ТЗЦены.Колонки.Добавить("Характеристика", ОписаниеХарактеристика);  
    ТЗЦены.Колонки.Добавить("Цена", ОписаниеЦена);
    ТЗЦены.Колонки.Добавить("ЕдИзмерения", ОписаниеУпаковка);
    
    Для Каждого Колонка Из ТЗЦены.Колонки Цикл
        ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения, "смартТаблицаСЦенами"));
    КонецЦикла;
    
    // Удаление - если таблица существует
    ЭлементТаблица = Элементы.Найти("смартТаблицаСЦенами");
    Если ЭлементТаблица <> Неопределено Тогда
        Элементы.Удалить(ЭлементТаблица);
    КонецЕсли;
    
    ДобавляемыеРеквизиты.Добавить(Реквизит_смартТаблицаЦен);
    ДобавляемыеРеквизиты.Добавить(Реквизит_смартПоказыватьЦены);	
    //-- Смарт:  Демичев №860 13.01.2022   
    
    //++ смарт:Подкин #1099 18.07.2022 16:45:46
    Реквизит_Резерв = Новый РеквизитФормы("Резерв", Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,3)), "ОстаткиТоваров", "Резерв");
    ДобавляемыеРеквизиты.Добавить(Реквизит_Резерв);  
    Реквизит_РезервОплачен = Новый РеквизитФормы("РезервОплачен", Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,3)), "ОстаткиТоваров", "РезервОплачен");
    ДобавляемыеРеквизиты.Добавить(Реквизит_РезервОплачен);
    //-- смарт:Подкин #1099 18.07.2022 16:45:46   
    
    ДобавляемыеРеквизиты.Добавить(Реквизит_смартПоказыватьКартинки);
    ДобавляемыеРеквизиты.Добавить(Реквизит_смартАдресКартинки);
    ИзменитьРеквизиты(ДобавляемыеРеквизиты);
    
    // Элемент флаг Показывать картинку
    смартПоказыватьКартинки = Элементы.Вставить("смартПоказыватьКартинки", Тип("ПолеФормы"), Элементы.РасширенныйПоискНоменклатура, Элементы.КоманднаяПанельПоискНоменклатура);
    смартПоказыватьКартинки.Вид = ВидПоляФормы.ПолеФлажка;
    смартПоказыватьКартинки.УстановитьДействие("ПриИзменении", "смартПоказыватьКартинкиПриИзменении");
    смартПоказыватьКартинки.ПутьКДанным = "смартПоказыватьКартинки";
    смартПоказыватьКартинки.Заголовок = "Показывать картинку";
    смартПоказыватьКартинки.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
    
    // Элемент смартГруппаОстатки
    смартГруппаОстатки = Элементы.Вставить("смартГруппаОстатки", Тип("ГруппаФормы"), Элементы.ГруппаНайденныеТовары, Элементы.ОстаткиТоваров);
    смартГруппаОстатки.Вид = ВидГруппыФормы.ОбычнаяГруппа;
    смартГруппаОстатки.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;  
    смартГруппаОстатки.ОтображатьЗаголовок = Ложь;
    
    Элементы.Переместить(Элементы.ОстаткиТоваров, смартГруппаОстатки);
    
    // Элемент смартЭлементКартинка
    смартЭлементКартинка = Элементы.Добавить("смартЭлементКартинка", Тип("ПолеФормы"), смартГруппаОстатки);
    смартЭлементКартинка.Вид = ВидПоляФормы.ПолеКартинки;
    смартЭлементКартинка.ПутьКДанным = "смартАдресКартинки";
    смартЭлементКартинка.ТекстНевыбраннойКартинки = "Картинка не найдена";
    смартЭлементКартинка.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
    смартЭлементКартинка.РазмерКартинки = РазмерКартинки.АвтоРазмер;
    
    //++ Смарт:  Демичев №860 13.01.2022   
    смартПоказыватьАктуальныеЦены = Элементы.Вставить("смартПоказыватьАктуальныеЦены", Тип("ПолеФормы"), Элементы.РасширенныйПоискНоменклатура, Элементы.КоманднаяПанельПоискНоменклатура);
    смартПоказыватьАктуальныеЦены.Вид = ВидПоляФормы.ПолеФлажка;
    смартПоказыватьАктуальныеЦены.УстановитьДействие("ПриИзменении", "смартПоказыватьЦеныПриИзменении");
    смартПоказыватьАктуальныеЦены.ПутьКДанным = "смартПоказыватьАктуальныеЦены";
    смартПоказыватьАктуальныеЦены.Заголовок = "Показывать цены";
    смартПоказыватьАктуальныеЦены.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;		
    
    // Добавление ТаблицыЗначений на форму
    ТаблицаПолейЦен = Элементы.Добавить("смартТаблицаСЦенами", Тип("ТаблицаФормы"));
    ТаблицаПолейЦен.ПутьКДанным = "смартТаблицаСЦенами";
    ТаблицаПолейЦен.Отображение = ОтображениеТаблицы.Список;
    ТаблицаПолейЦен.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет; // Отключение командной панели
    
    Для Каждого Колонка Из ТЗЦены.Колонки Цикл
        
        НовыйЭлемент = Элементы.Добавить(Колонка.Имя, Тип("ПолеФормы"), ТаблицаПолейЦен);
        НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
        НовыйЭлемент.ПутьКДанным = "смартТаблицаСЦенами." + Колонка.Имя;
        НовыйЭлемент.Ширина = 7;
        
    КонецЦикла; 
    
    Элементы.Переместить(Элементы.смартТаблицаСЦенами, смартГруппаОстатки,смартЭлементКартинка);
    
    Элементы.смартТаблицаСЦенами.ТолькоПросмотр = Истина;
    Элементы.смартТаблицаСЦенами.Видимость = Ложь;
    //-- Смарт:  Демичев №860 13.01.2022  
    
    //++ смарт:Подкин #1099 17.07.2022 17:47:24 
    КолонкаРезерв = Элементы.Добавить("смартОстаткиТоваровРезерв", Тип("ПолеФормы"), Элементы.ОстаткиТоваров);
    КолонкаРезерв.ПутьКДанным = "ОстаткиТоваров.Резерв";
    КолонкаРезерв.Заголовок = "Резерв";
    КолонкаРезерв.Вид = ВидПоляФормы.ПолеВвода;  
    Элементы.смартОстаткиТоваровРезерв.Формат = "ЧДЦ=3"; 
    
    КолонкаРезерв = Элементы.Добавить("смартОстаткиТоваровРезервОплачен", Тип("ПолеФормы"), Элементы.ОстаткиТоваров);
    КолонкаРезерв.ПутьКДанным = "ОстаткиТоваров.РезервОплачен";
    КолонкаРезерв.Заголовок = "Резерв оплачен";
    КолонкаРезерв.Вид = ВидПоляФормы.ПолеВвода;  
    Элементы.смартОстаткиТоваровРезервОплачен.Формат = "ЧДЦ=3";
    
    //Создаем Команды
    НоваяКоманда = Команды.Добавить("смартДействиеРасшифровкаОплаченныхЗаказов");
    НоваяКоманда.Действие = "смартДействиеРасшифровкаОплаченныхЗаказов";
    НоваяКоманда.Заголовок = "Оплаченные заказы";    
    
    НоваяКоманда2 = Команды.Добавить("смартДействиеРасшифровкаНеОплаченныхЗаказов");
    НоваяКоманда2.Действие = "смартДействиеРасшифровкаНеОплаченныхЗаказов";
    НоваяКоманда2.Заголовок = "Не оплаченные заказы";
    
    НоваяКоманда1 = Команды.Добавить("смартДействиеРасшифровкаЗаказов");
    НоваяКоманда1.Действие = "смартДействиеРасшифровкаЗаказов";
    НоваяКоманда1.Заголовок = "Все заказы"; 
    
    //Создаем кнопки      
    НоваяКнопка = Элементы.Вставить("смартРасшифровкаОплаченныхЗаказов", Тип("КнопкаФормы"),Элементы.ОстаткиТоваровКоманднаяПанель);//смартГруппаОстатки,,
    НоваяКнопка.ИмяКоманды = "смартДействиеРасшифровкаОплаченныхЗаказов";  
    //НоваяКнопка.Отображение=ОтображениеКнопки.КартинкаИТекст;
    //НоваяКнопка.Картинка=БиблиотекаКартинок.РегистрНакопления;
    НоваяКнопка.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели; 
    НоваяКнопка.Доступность=Ложь;  
    Элементы.ОстаткиТоваров.КоманднаяПанель.ГоризонтальноеПоложение=ГоризонтальноеПоложениеЭлемента.Право; 
     
    НоваяКнопка = Элементы.Вставить("смартРасшифровкаНеОплаченныхЗаказов", Тип("КнопкаФормы"),Элементы.ОстаткиТоваровКоманднаяПанель);//смартГруппаОстатки,,
    НоваяКнопка.ИмяКоманды = "смартДействиеРасшифровкаНеОплаченныхЗаказов";  
    НоваяКнопка.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели; 
    НоваяКнопка.Доступность=Ложь;  
    Элементы.ОстаткиТоваров.КоманднаяПанель.ГоризонтальноеПоложение=ГоризонтальноеПоложениеЭлемента.Право; 
    
    НоваяКнопка = Элементы.Вставить("смартРасшифровкаЗаказов", Тип("КнопкаФормы"),Элементы.ОстаткиТоваровКоманднаяПанель);//смартГруппаОстатки,,
    НоваяКнопка.ИмяКоманды = "смартДействиеРасшифровкаЗаказов";  
    //НоваяКнопка.Отображение=ОтображениеКнопки.КартинкаИТекст;
    НоваяКнопка.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели; 
    НоваяКнопка.Доступность=Ложь;  
    Элементы.ОстаткиТоваров.КоманднаяПанель.ГоризонтальноеПоложение=ГоризонтальноеПоложениеЭлемента.Право; 
    
   

    Элементы.ОтображатьОстаткиНадпись.Ширина=150;
    //-- смарт:Подкин #1099 17.07.2022 17:47:24  
    
КонецПроцедуры //-- смарт:ММ 03.01.2021

//++ Смарт:  Демичев №860 13.01.2022
&НаКлиенте
Процедура смартПоказыватьЦеныПриИзменении(Элемент)
	
	Элементы.смартТаблицаСЦенами.Видимость = ЭтаФорма.смартПоказыватьАктуальныеЦены;
	
	смартПоказыватьЦеныВТаблице();
	
КонецПроцедуры 

&НаКлиенте
Процедура смартПоказыватьЦеныВТаблице(ТекСтрока = Неопределено)
	
	Если Не ЭтаФорма.смартПоказыватьАктуальныеЦены Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекСтрока = Неопределено Тогда
		
		ТекСтрока = Элементы.СписокРасширенныйПоискНоменклатура.ТекущиеДанные;
		
	КонецЕсли;
	
	Если ТекСтрока = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Элементы.смартТаблицаСЦенами.ПодчиненныеЭлементы.Характеристика.Видимость = ТекСтрока.ХарактеристикиИспользуются;
	ЗаполнитьТаблицуСЦенамиНоменклатуры(ТекСтрока.Ссылка);
		
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьТаблицуСЦенамиНоменклатуры(Номенклатура)

    //++ смарт:Подкин #1025 п.4 22.05.2022 18:19:38
    СегментВыбранЕВРО = Справочники.смартПредопределенныеЗначения.СегментВалютныхЗаказов.Значение;
    ПродажаВРублях = НЕ Справочники.смартПредопределенныеЗначения.ПереходНаПродажуВРублях.Значение=Неопределено И Справочники.смартПредопределенныеЗначения.ПереходНаПродажуВРублях.Значение; 
    ВходитВСегментЕВРО = СегментыСервер.ВходитВСегмент(Номенклатура,СегментВыбранЕВРО);
    Массив=Новый Массив;
    СтруктураВалюты=Новый Структура;
    СписокВидовЦен = Новый СписокЗначений; 
    СтруктураВалюты.Вставить("Ключ","ВалютаЦены");
    
	Если ВходитВСегментЕВРО Тогда
		
        //И (НЕ Пользователи.ЭтоПолноправныйПользователь() И НЕ РольДоступна("смартРазрешитьПросмотрВсехВидовЦенВВалюте")) Тогда
        //СтруктураВалюты.Вставить("Значение",Константы.ВалютаУправленческогоУчета.Получить());
        //Массив.Добавить(СтруктураВалюты);
        //СписокВидовЦен.ЗагрузитьЗначения(Справочники.ВидыЦен.ДоступныеВидыЦен(Массив));
		
	ИначеЕсли ПродажаВРублях И (НЕ Пользователи.ЭтоПолноправныйПользователь() И НЕ Пользователи.РолиДоступны("смартРазрешитьПросмотрВсехВидовЦенВВалюте")) Тогда
		
        СтруктураВалюты.Вставить("Значение",Константы.ВалютаРегламентированногоУчета.Получить());
        Массив.Добавить(СтруктураВалюты);
        СписокВидовЦен.ЗагрузитьЗначения(Справочники.ВидыЦен.ДоступныеВидыЦен(Массив));
		
	ИначеЕсли НЕ ПродажаВРублях И (НЕ Пользователи.ЭтоПолноправныйПользователь() И НЕ Пользователи.РолиДоступны("смартРазрешитьПросмотрВсехВидовЦенВВалюте")) Тогда
		
        СтруктураВалюты.Вставить("Значение",Справочники.Валюты.НайтиПоКоду("000"));
        Массив.Добавить(СтруктураВалюты);
        СписокВидовЦен.ЗагрузитьЗначения(Справочники.ВидыЦен.ДоступныеВидыЦен(Массив));
		
    КонецЕсли;
    //-- смарт:Подкин #1025 п.4 22.05.2022 18:19:38
    
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЦеныНоменклатурыСрезПоследних.ВидЦены КАК ВидЦены,
	|	ЦеныНоменклатурыСрезПоследних.Характеристика КАК Характеристика,
	|	МАКСИМУМ(ЦеныНоменклатурыСрезПоследних.Цена) КАК Цена,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ЦеныНоменклатурыСрезПоследних.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|				ТОГДА ЦеныНоменклатурыСрезПоследних.Номенклатура.ЕдиницаИзмерения
	|			ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Упаковка, ЦеныНоменклатурыСрезПоследних.Номенклатура.ЕдиницаИзмерения)
	|		КОНЕЦ) КАК ЕдИзмерения
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|			КОНЕЦПЕРИОДА(&Дата, ДЕНЬ),
	|			ВидЦены.ИспользоватьПриПродаже
    //++ смарт:Подкин #1025 п.4 22.05.2022 18:59:23 
    |				И Номенклатура = &Номенклатура И Условие) КАК ЦеныНоменклатурыСрезПоследних 
	//|				И Номенклатура = &Номенклатура) КАК ЦеныНоменклатурыСрезПоследних     
    //-- смарт:Подкин #1025 п.4 22.05.2022 18:59:23
	|
	|СГРУППИРОВАТЬ ПО
	|	ЦеныНоменклатурыСрезПоследних.ВидЦены,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура,
	|	ЦеныНоменклатурыСрезПоследних.Характеристика";
	
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
    
    //++ смарт:Подкин #1025 п.4 22.05.2022 18:55:12
    Если СписокВидовЦен.Количество() Тогда
    	Запрос.Текст=СтрЗаменить(Запрос.Текст,"И Условие","И ВидЦены в (&СписокЦен)");
        Запрос.УстановитьПараметр("СписокЦен", СписокВидовЦен);
    Иначе
        Запрос.Текст=СтрЗаменить(Запрос.Текст,"И Условие","");
    КонецЕсли;
    //-- смарт:Подкин #1025 п.4 22.05.2022 18:55:12	
    
	РезультатЗапроса = Запрос.Выполнить();
	
	ТекущаяТаблица = РеквизитФормыВЗначение("смартТаблицаСЦенами");
	
    ТекущаяТаблица.Очистить();
    ТекущаяТаблица = РезультатЗапроса.Выгрузить();	
	
	ЗначениеВРеквизитФормы(ТекущаяТаблица,"смартТаблицаСЦенами");
	
КонецПроцедуры	

//-- Смарт:  Демичев №860 13.01.2022

//++ смарт:ММ #091 401 04.01.2021 - Фото товара в форме подбора 
&НаСервере
Процедура смартНастроитьВидимостьДоступность()

	Элементы.смартЭлементКартинка.Видимость = ЭтаФорма.смартПоказыватьКартинки;
	
КонецПроцедуры //-- смарт:ММ 04.01.2021

//++ смарт:ММ #091 401 04.01.2021 - Фото товара в форме подбора
&НаКлиенте
Процедура смартПоказыватьКартинкиПриИзменении(Элемент)
	
	смартНастроитьВидимостьДоступность();
	
КонецПроцедуры //-- смарт:ММ 04.01.2021

//++ смарт:ММ #091 401 04.01.2021 - Фото товара в форме подбора
&НаКлиенте
&После("ПодборТаблицаНоменклатураПриАктивизацииСтроки")
Процедура смарт_ПодборТаблицаНоменклатураПриАктивизацииСтроки(Элемент)
	
	СтрокаТаблицыНоменклатуры = Элемент.ТекущиеДанные;
	
    Если СтрокаТаблицыНоменклатуры <> Неопределено Тогда
        СсылкаНаСправочник = СтрокаТаблицыНоменклатуры.Ссылка;		
        ЭтаФорма.смартАдресКартинки = смартПолучитьАдресКартинки(СсылкаНаСправочник, ЭтотОбъект.УникальныйИдентификатор); 
        //++ Смарт:  Демичев №860 13.01.2022 
        смартПоказыватьЦеныВТаблице(СтрокаТаблицыНоменклатуры);
        //-- Смарт:  Демичев №860 13.01.2022 
        
        //++ смарт:Подкин #1099 17.07.2022 20:27:18 
        Если ЗначениеЗаполнено(СтрокаТаблицыНоменклатуры.Резерв) Тогда  
            Элементы.смартРасшифровкаЗаказов.Доступность=Истина; 
        Иначе
            Элементы.смартРасшифровкаЗаказов.Доступность=Ложь;
        КонецЕсли;
        //-- смарт:Подкин #1099 17.07.2022 20:27:18	  
        
	КонецЕсли;
	
	//++ #Б3742 смарт: Шляпников 20.08.2025 / Подбор аналогов при выборе товара
	Если Элемент.ТекущиеДанные <> Неопределено И Элемент.ТекущиеДанные.КоличествоАналогов > 0 Тогда
		
		Элементы.смартПоказатьАналоги.Доступность = Истина;
		Элементы.смартПоказатьАналоги1.Доступность = Истина;
		Элементы.смартПоказатьАналоги1.ЦветФона = Новый Цвет(192, 220, 192);
		Элементы.смартПоказатьАналоги.ЦветФона = Новый Цвет(192, 220, 192);
		
	Иначе
		
		Элементы.смартПоказатьАналоги.Доступность = Ложь;
		Элементы.смартПоказатьАналоги1.Доступность = Ложь;
		Элементы.смартПоказатьАналоги1.ЦветФона = ПолучитьЦветФонаКнопкиПоУмолчанию();
		Элементы.смартПоказатьАналоги.ЦветФона = ПолучитьЦветФонаКнопкиПоУмолчанию();
		
	КонецЕсли;
	//-- #Б3742 смарт: Шляпников 20.08.2025
	
	//++ #Б4818 смарт: Шляпников 17.11.2025 / Создание механизма учета скидок и акций по оборудованию. 
	ПодключитьОбработчикОжидания("смартЗаполнитьИнформациюОбАкцяхПоСтроке", 0.1, Истина);
	//-- #Б4818 смарт: Шляпников 17.11.2025
    
КонецПроцедуры //-- смарт:ММ 04.01.2021

//++ смарт:ММ #091 401 04.01.2021 - Фото товара в форме подбора
&НаСервереБезКонтекста
Функция смартПолучитьАдресКартинки(СсылкаНаСправочник, ИД)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		АдресКартинки = РаботаСФайлами.ДанныеФайла(СсылкаНаСправочник.ФайлКартинки, ИД).СсылкаНаДвоичныеДанныеФайла;
	Исключение
		АдресКартинки = "";
	КонецПопытки;
		
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат АдресКартинки;
	
КонецФункции //-- смарт:ММ 04.01.2021

//++ смарт:Подкин #1099 18.07.2022 11:25:51
&НаКлиенте
Процедура смартДействиеРасшифровкаОплаченныхЗаказов()    
    
    ТекСтрока=Элементы.СписокСтандартныйПоискНоменклатура.ТекущиеДанные;
    ТекСтрокаОстаткиТоваров=Элементы.ОстаткиТоваров.ТекущиеДанные;
    Если ТекСтрока=Неопределено Тогда
        ТекСтрока=Элементы.СписокРасширенныйПоискНоменклатура.ТекущиеДанные;
    КонецЕсли;  
    Если ТекСтрокаОстаткиТоваров<>Неопределено Тогда
        ПараметрыОтбора=Новый Структура("Склад, Номенклатура, Оплаченные, Сейчас, Фон",ТекСтрокаОстаткиТоваров.Склад,ТекСтрока.Номенклатура,Истина,ТекСтрокаОстаткиТоваров.ПериодОписание, Истина);
        ОткрытьФорму("Обработка.ПодборТоваровВДокументПродажи.Форма.смарт_ФормаОплаченныеЗаказы",ПараметрыОтбора,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
    КонецЕсли;         
    
КонецПроцедуры //-- смарт:Подкин #1099 18.07.2022 11:25:51

//++ смарт:Подкин #1099 18.07.2022 11:25:51
&НаКлиенте
Процедура смартДействиеРасшифровкаЗаказов()    
    
    ТекСтрока=Элементы.СписокСтандартныйПоискНоменклатура.ТекущиеДанные;
    ТекСтрокаОстаткиТоваров=Элементы.ОстаткиТоваров.ТекущиеДанные;
    Если ТекСтрока=Неопределено Тогда
        ТекСтрока=Элементы.СписокРасширенныйПоискНоменклатура.ТекущиеДанные;
    КонецЕсли;  
    Если ТекСтрокаОстаткиТоваров<>Неопределено Тогда
        Оповещение = Новый ОписаниеОповещения("смартОткрытьПодробноРезервыПоНоменклатуреИЛИСкладу", ЭтаФорма);
        ПоказатьВопрос(Оповещение, "Да - расшифровка резерва по номенклатуре(верх),"+Символы.ПС+"Нет - расшифровка резерва по складу(низ)", РежимДиалогаВопрос.ДаНет);
    Иначе
        ПараметрыОтбора=Новый Структура("Склад, Номенклатура, Оплаченные, Сейчас",Склад,ТекСтрока.Номенклатура,Неопределено,"Сейчас");
        ОткрытьФорму("Обработка.ПодборТоваровВДокументПродажи.Форма.смарт_ФормаОплаченныеЗаказы",ПараметрыОтбора,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
    КонецЕсли;         
    
КонецПроцедуры //-- смарт:Подкин #1099 18.07.2022 11:25:51

//++ смарт:Подкин #1099 29.07.2022 9:08:17
&НаКлиенте
Процедура смартДействиеРасшифровкаНеОплаченныхЗаказов()    
    
    ТекСтрока=Элементы.СписокСтандартныйПоискНоменклатура.ТекущиеДанные;
    ТекСтрокаОстаткиТоваров=Элементы.ОстаткиТоваров.ТекущиеДанные;
    Если ТекСтрока=Неопределено Тогда
        ТекСтрока=Элементы.СписокРасширенныйПоискНоменклатура.ТекущиеДанные;
    КонецЕсли;  
    Если ТекСтрокаОстаткиТоваров<>Неопределено Тогда
        ПараметрыОтбора=Новый Структура("Склад, Номенклатура, Оплаченные, Сейчас, Фон",ТекСтрокаОстаткиТоваров.Склад,ТекСтрока.Номенклатура,Ложь,ТекСтрокаОстаткиТоваров.ПериодОписание, Истина);
        ОткрытьФорму("Обработка.ПодборТоваровВДокументПродажи.Форма.смарт_ФормаОплаченныеЗаказы",ПараметрыОтбора,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
    КонецЕсли;         
    
КонецПроцедуры //-- смарт:Подкин #1099 29.07.2022 9:08:17

 //++ смарт:Подкин #1099 27.07.2022 15:00:38
&НаКлиенте
Процедура смартОткрытьПодробноРезервыПоНоменклатуреИЛИСкладу(Ответ, ДополнительныеПараметры) Экспорт 
    
	//++#1383 смарт: Лопато 22.06.2023 //Описание  
	//ТекСтрока=Элементы.СписокСтандартныйПоискНоменклатура.ТекущиеДанные;
	//Если ТекСтрока=Неопределено Тогда
	//    ТекСтрока=Элементы.СписокРасширенныйПоискНоменклатура.ТекущиеДанные;
	//КонецЕсли;
    ТекСтрокаОстаткиТоваров=Элементы.ОстаткиТоваров.ТекущиеДанные;
	Номенклатура = Элементы.СписокРасширенныйПоискНоменклатура.ТекущаяСтрока;
	//--#1383 смарт: Лопато 22.06.2023
	Если Ответ = КодВозвратаДиалога.Да Тогда 
        //Вывод расшифровки по верхней ТЧ Номенклатуры
		//++#1383 смарт: Лопато 22.06.2023 //Описание  
        ПараметрыОтбора=Новый Структура("Склад, Номенклатура, Оплаченные, Сейчас",Склад,Номенклатура,Неопределено,"Сейчас");
		//--#1383 смарт: Лопато 22.06.2023
        ОткрытьФорму("Обработка.ПодборТоваровВДокументПродажи.Форма.смарт_ФормаОплаченныеЗаказы",ПараметрыОтбора,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
    ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда  
         //Вывод расшифровки по нижней ТЧ Остатки номенклатры Склады
		//++#1383 смарт: Лопато 22.06.2023 //Описание  
        ПараметрыОтбора=Новый Структура("Склад, Номенклатура, Оплаченные, Сейчас, Фон",ТекСтрокаОстаткиТоваров.Склад,Номенклатура,Неопределено,ТекСтрокаОстаткиТоваров.ПериодОписание, Истина);
		//--#1383 смарт: Лопато 22.06.2023
        ОткрытьФорму("Обработка.ПодборТоваровВДокументПродажи.Форма.смарт_ФормаОплаченныеЗаказы",ПараметрыОтбора,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
    КонецЕсли;
	
КонецПроцедуры //-- смарт:Подкин #1099 27.07.2022 15:00:38

//++ #Б1480 смарт: Шляпников 03.12.2024 / Раздельный учет товаров. Гарантийные запчасти. Доработка вывода оперативных остатков
&НаСервере
Процедура смартСкорректироватьЗапросПоОстаткамСУчетомФалагаГарантийныхЗапчастей()
	
	ПодборТоваровСервер.ПерейтиКСпискуНоменклатуры(ЭтаФорма);
	ПодборТоваровСервер.УстановитьТекстыЗапросовСписковФормыПодбора(ЭтаФорма);
	
КонецПроцедуры

//++ #Б4210 смарт: Шляпников 29.08.2025 / Доработка механизма Аналогов. 
&НаСервереБезКонтекста
Функция ПолучитьЦветФонаКнопкиПоУмолчанию()
	Возврат ЦветаСтиля.ЦветФонаКнопки;
КонецФункции

#КонецОбласти

#Область КомандыИСобытияЭлементов

//++ #Б3742 смарт: Шляпников 20.08.2025 / Подбор аналогов при выборе товара
&НаКлиенте
Процедура смартПоказатьАналогиКлиент(Команда)
	
	Если Элементы.СтраницыСписков.ТекущаяСтраница = Элементы.СтраницаРасширенныйПоискНоменклатура Тогда
		ТекущаяСтрока = Элементы.СписокРасширенныйПоискНоменклатура.ТекущаяСтрока;
	ИначеЕсли Элементы.СтраницыСписков.ТекущаяСтраница = Элементы.СтраницаСтандартныйПоискНоменклатура Тогда
		ТекущаяСтрока = Элементы.СписокСтандартныйПоискНоменклатура.ТекущаяСтрока;
	КонецЕсли;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Номенклатура", ТекущаяСтрока);
	
	Оповещение = Новый ОписаниеОповещения("смартПоказатьАналогиЗавершениеКлиент", ЭтаФорма);
	
	ОткрытьФорму("РегистрСведений.смартАналогиНоменклатуры.Форма.ФормаВыбораАналога", ПараметрыФормы, ЭтаФорма,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

//++ #Б3742 смарт: Шляпников 20.08.2025 / Подбор аналогов при выборе товара
&НаКлиенте
Процедура смартПоказатьАналогиЗавершениеКлиент(Значение, ДопПараметры) Экспорт
	
	Если НЕ Значение = Неопределено Тогда
		
		//смена иерархии
		Элементы.ИерархияНоменклатуры.ТекущаяСтрока = ПолучитьРодителяНоменклатуры(Значение);
		
		Если ИспользоватьФильтры И (ВариантНавигации = ПредопределенноеЗначение("Перечисление.ВариантыНавигацииВФормахНоменклатуры.ПоИерархии")) Тогда
			ПодборТоваровКлиент.ОбработчикАктивизацииСтрокиИерархииНоменклатуры(ЭтаФорма);
		КонецЕсли;
		
		//смена вида номенклатуры
		Элементы.ВидыНоменклатуры.ТекущаяСтрока = ПолучитьВидНоменклатуры(Значение);
		
		Если ВариантНавигации = ПредопределенноеЗначение("Перечисление.ВариантыНавигацииВФормахНоменклатуры.ПоСвойствам")
			Или ВариантНавигации = ПредопределенноеЗначение("Перечисление.ВариантыНавигацииВФормахНоменклатуры.ПоВидамИСвойствам")
			Или ВариантНавигации = ПредопределенноеЗначение("Перечисление.ВариантыНавигацииВФормахНоменклатуры.ПоВидам") Тогда
			
			ТекущиеДанные = Элементы.ВидыНоменклатуры.ТекущиеДанные;
		
			Если НЕ ТекущиеДанные = Неопределено И ИспользоватьФильтры Тогда
				
				ВидНоменклатуры = ТекущиеДанные.Ссылка;
				ВидНоменклатурыПриИзмененииНаСервере();
			
			КонецЕсли;
			
		КонецЕсли;
		
		Если Элементы.СтраницыСписков.ТекущаяСтраница = Элементы.СтраницаРасширенныйПоискНоменклатура Тогда
			
			Элементы.СписокРасширенныйПоискНоменклатура.ТекущаяСтрока = Значение;
			Элементы.СписокРасширенныйПоискНоменклатура.Обновить();
			
		ИначеЕсли Элементы.СтраницыСписков.ТекущаяСтраница = Элементы.СтраницаСтандартныйПоискНоменклатура Тогда
			
			Элементы.СписокСтандартныйПоискНоменклатура.ТекущаяСтрока = Значение;
			Элементы.СписокСтандартныйПоискНоменклатура.Обновить();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

//++ #Б3742 смарт: Шляпников 20.08.2025 / Подбор аналогов при выборе товара
Функция ПолучитьРодителяНоменклатуры(Номенклатура)
	Возврат Номенклатура.Родитель;
КонецФункции

//++ #Б3742 смарт: Шляпников 20.08.2025 / Подбор аналогов при выборе товара
Функция ПолучитьВидНоменклатуры(Номенклатура)
	Возврат Номенклатура.ВидНоменклатуры;
КонецФункции

#КонецОбласти

#Область ПеренесеноСДоработками

&НаКлиенте
Процедура смарт_КорзинаХарактеристикаПриИзмененииПосле(Элемент)
	// Каратеев+
	ТекущаяСтрока = Элементы.Корзина.ТекущиеДанные;
	Товар = ТекущаяСтрока.Номенклатура;  
	Если НоменклатураВРулонахПоХарактеристикам(Товар)  Тогда
		
		ТекущаяСтрока.КоличествоУпаковок = 0;
		ТекущаяСтрока.Количество = 0;
		
	КонецЕсли;
	// Каратеев-
КонецПроцедуры

&НаКлиенте
Процедура смарт_КорзинаКоличествоУпаковокПриИзмененииПеред(Элемент)
	// Фролов+
	ТекущаяСтрока = Элементы.Корзина.ТекущиеДанные;
	Если НоменклатураВРулонахПоХарактеристикам(ТекущаяСтрока.Номенклатура) 
		И Не КоличествоВыбраноВерно(ТекущаяСтрока.КоличествоУпаковок,ТекущаяСтрока.Характеристика) Тогда 
		
		ТекущаяСтрока.КоличествоУпаковок = 0;
		ТекущаяСтрока.Количество = 0;
		Текст="Количество погонных метров должно быть кратно намотке рулона!
			|Укажите другое количество погонных метров.";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,"Объект.Корзина["+ТекущаяСтрока.ПолучитьИдентификатор()+"].КоличествоУпаковок");
	КонецЕсли;
	// Фролов-
КонецПроцедуры

&НаКлиенте
&Перед("ДобавитьВКорзинуПослеВыбораКоличества")
Процедура смарт_ДобавитьВКорзинуПослеВыбораКоличества(Результат, ДополнительныеПараметры)
	ДополнительныеПараметры.Вставить("КоличествоПоХарактеристикеРассчитано",Истина);
КонецПроцедуры

&НаКлиенте
Процедура смарт_ПеренестиВДокументПеред(Команда) // адаптация Малыгина 30.01.2020
	
	ПроверяемыеСтроки=Объект.Корзина.НайтиСтроки(Новый Структура("ХарактеристикиИспользуются",Истина));
	Для Каждого Стр Из ПроверяемыеСтроки Цикл 
		Если НоменклатураВРулонахПоХарактеристикам(Стр.Номенклатура) 
			И Не ОтгрузкаВРулонахКратнаНамотке(СтрокуВЧисло(Стр.Характеристика),Стр.КоличествоУпаковок) Тогда 
			
			Текст="В строке "+Стр.НомерСтроки+" количество погонных метров должно быть кратно намотке рулона!
				|Укажите другое количество погонных метров."; 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,"Объект.Корзина["+Стр.ПолучитьИдентификатор()+"]",,);
			Возврат;
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры

//++ смарт:Подкин #1099 19.07.2022 11:46:11
&НаКлиенте
Процедура смарт_ОстаткиТоваровПриАктивизацииСтрокиПосле(Элемент)
    СтрокаТаблицыНоменклатуры = Элементы.СписокСтандартныйПоискНоменклатура.ТекущиеДанные;
    СтрокаДереваОстаткиТоваров=Элементы.ОстаткиТоваров.ТекущиеДанные;  
    Если СтрокаДереваОстаткиТоваров <> Неопределено Тогда
        Элементы.смартРасшифровкаОплаченныхЗаказов.Доступность=Истина; 
        Элементы.смартРасшифровкаНеОплаченныхЗаказов.Доступность=Истина;
        Элементы.смартРасшифровкаЗаказов.Доступность=Истина;
    ИначеЕсли НЕ СтрокаТаблицыНоменклатуры=Неопределено И НЕ СтрокаТаблицыНоменклатуры.Резерв=0 И СтрокаТаблицыНоменклатуры.Доступно=0 Тогда   
        Элементы.смартРасшифровкаОплаченныхЗаказов.Доступность=Ложь;
        Элементы.смартРасшифровкаНеОплаченныхЗаказов.Доступность=Ложь;
        Элементы.смартРасшифровкаЗаказов.Доступность=Истина;
    Иначе
        Элементы.смартРасшифровкаОплаченныхЗаказов.Доступность=Ложь;
        Элементы.смартРасшифровкаНеОплаченныхЗаказов.Доступность=Ложь;
        Элементы.смартРасшифровкаЗаказов.Доступность=Ложь; 
    КонецЕсли;
КонецПроцедуры//-- смарт:Подкин #1099 19.07.2022 11:46:11

//++ #1351 смарт: Фролов 15.05.2023 //Разделение остатков по организациям в заказах  
&НаКлиенте
Процедура смарт_ОбработкаВыбораПосле(ВыбранноеЗначение, ИсточникВыбора)
	Если НоменклатураКлиент.ЭтоУказаниеСерий(ИсточникВыбора) Тогда
		ТекущиеДанные = Элементы.Корзина.ТекущиеДанные;
		Попытка
			РезультатПроверки=смартПроверитьСериюПоОрганизации(ИсточникВыбора.ВладелецФормы.Организация,ВыбранноеЗначение.Значение); 
			Если РезультатПроверки ТОгда
				ТекущиеДанные.Серия = ВыбранноеЗначение.Значение;
			Иначе
				Сообщить("Серия "+ВыбранноеЗначение.Значение+" не принадлежит организации "+ИсточникВыбора.ВладелецФормы.Организация+"");
				ТекущиеДанные.Серия = Неопределено;
			КонецЕсли;	
		Исключение
			
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры //-- #1351 смарт: Фролов 15.05.2023

//++ #1351 смарт: Фролов 15.05.2023 //Разделение остатков по организациям в заказах  
&НаСервере
Функция смартПроверитьСериюПоОрганизации(Организация,Серия)
	Запрос=Новый Запрос("  ВЫБРАТЬ
			|	ТоварыОрганизацийОбороты.АналитикаУчетаНоменклатуры.Серия КАК Серия,
			|	ТоварыОрганизацийОбороты.Организация КАК Организация,
			|	СУММА(ТоварыОрганизацийОбороты.КоличествоПриход) КАК Количество
			|ИЗ
			|	РегистрНакопления.ТоварыОрганизаций.Обороты КАК ТоварыОрганизацийОбороты
			|ГДЕ
			|	ТоварыОрганизацийОбороты.АналитикаУчетаНоменклатуры.Серия = &Серия
			|
			|СГРУППИРОВАТЬ ПО
			|	ТоварыОрганизацийОбороты.АналитикаУчетаНоменклатуры.Серия,
			|	ТоварыОрганизацийОбороты.Организация");
	Запрос.УстановитьПараметр("Серия",Серия);
	Рез=Запрос.Выполнить().Выгрузить(); 
	Если Рез.Количество()>0 Тогда
		Нашли=Ложь;
		Для Каждого Стр Из Рез Цикл
			Если Стр.Организация=Организация ТОгда
				Нашли=Истина;
			КонецЕсли;
		КонецЦикла;
		Если НЕ Нашли ТОгда
			Возврат Ложь; 
		Иначе	
			Возврат Истина;
		КонецЕсли;	
	КонецЕсли;	
	Возврат Истина;	
КонецФункции //-- #1351 смарт: Фролов 15.05.2023

//++ #Б1480 смарт: Шляпников 03.12.2024 / Раздельный учет товаров. Гарантийные запчасти. Доработка вывода оперативных остатков
&НаКлиенте
Процедура смарт_ПриОткрытииПосле(Отказ)
	
	Попытка
		смартЗапчастиГарантийныеИзДокумента = ВладелецФормы.Объект.смартЗапчастиГарантийные;
	Исключение
		Возврат;
	КонецПопытки;
	
	Если НЕ смартЗапчастиГарантийныеИзДокумента = ЭтаФорма.смартЗапчастиГарантийные Тогда
		ЭтаФорма.смартЗапчастиГарантийные = смартЗапчастиГарантийныеИзДокумента;
		смартСкорректироватьЗапросПоОстаткамСУчетомФалагаГарантийныхЗапчастей();
	КонецЕсли;
	
КонецПроцедуры

//++ #Б4818 смарт: Шляпников 17.11.2025 / Создание механизма учета скидок и акций по оборудованию. 
&НаКлиенте
Процедура смартЗаполнитьИнформациюОбАкцяхПоСтроке()
	смартЗаполнитьИнформациюОбАкцяхПоСтрокеСервер();
КонецПроцедуры

//++ #Б4818 смарт: Шляпников 17.11.2025 / Создание механизма учета скидок и акций по оборудованию. 
&НаСервере
Процедура смартЗаполнитьИнформациюОбАкцяхПоСтрокеСервер()
	
	Если Элементы.СтраницыСписков.ТекущаяСтраница = Элементы.СтраницаСтандартныйПоискНоменклатура Тогда
		Номенклатура = Элементы.СписокСтандартныйПоискНоменклатура.ТекущаяСтрока;
	ИначеЕсли Элементы.СтраницыСписков.ТекущаяСтраница = Элементы.СтраницаСтандартныйПоискХарактеристики Тогда
		Номенклатура = Элементы.СписокСтандартныйПоискХарактеристики.ТекущаяСтрока;
	ИначеЕсли Элементы.СтраницыСписков.ТекущаяСтраница = Элементы.СтраницаРасширенныйПоискНоменклатура Тогда
		Номенклатура = Элементы.СписокРасширенныйПоискНоменклатура.ТекущаяСтрока;
	ИначеЕсли Элементы.СтраницыСписков.ТекущаяСтраница = Элементы.СтраницаРасширенныйПоискХарактеристики Тогда
		Номенклатура = Элементы.СписокРасширенныйПоискХарактеристики.ТекущаяСтрока;
	Иначе
		Возврат;
	КонецЕсли;
	
	смартАкцииИСкидки.ЗаполнитьИнформациюПоДействующимСкидкамНоменклатурыВФормеПодбора(ЭтаФорма, Организация, Номенклатура);
	
КонецПроцедуры

#КонецОбласти
